## Concatanate DataFrames

In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({                            # Data Frame 1
    "city" : ["mumbai","delhi","bangalore"],
    "temperature" : [32,40,35],
    "humidity" : [80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78

In [3]:
us_weather = pd.DataFrame({                               # Data Frame 2
    "city" : ["new york","chicago","orlando"],
    "temperature" : [21,14,35],
    "humidity" : [68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## 1. Append DataFrame 2 as row (on top of each other)

Both gives same result:

    df = pd.concat([india_weather,us_weather])
    
    df = pd.concat([india_weather,us_weather],axis=0)

In [4]:
df = pd.concat([india_weather,us_weather])           # Concatanate = Data Frame 1 + Data Frame 2
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [5]:
df = pd.concat([india_weather,us_weather],axis=0)                 # Concatanate = Data Frame 1 + Data Frame 2
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [6]:
df = pd.concat([india_weather,us_weather],ignore_index=True)      # Generating index 0 1 2 3 4 5 instead of 0 1 2 0 1 2
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [7]:
df = pd.concat([india_weather,us_weather], keys=["india","us"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           40        60
      2  bangalore           35        78
us    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [8]:
df.loc["india"]

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78

In [9]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## 2. Append DataFrame 2 as Column

In [10]:
temperature_df = pd.DataFrame({                            # Data Frame 3
    "city" : ["mumbai","delhi","bangalore"],
    "temperature" : [32,40,35]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           40
2  bangalore           35

In [11]:
windspeed_df = pd.DataFrame({                            # Data Frame 4
    "city" : ["mumbai","delhi","bangalore"],
    "windspeed" : [7,12,9]
})
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         12
2  bangalore          9

In [12]:
df = pd.concat([temperature_df,windspeed_df],axis=1)           # Concatanate = Data Frame 3 + Data Frame 4
df

        city  temperature       city  windspeed
0     mumbai           32     mumbai          7
1      delhi           40      delhi         12
2  bangalore           35  bangalore          9

## 3. Index

In [13]:
temperature_df = pd.DataFrame({                            # Data Frame 5
    "city" : ["mumbai","delhi","bangalore"],
    "temperature" : [32,40,35]
},index=[0,1,2])
temperature_df

        city  temperature
0     mumbai           32
1      delhi           40
2  bangalore           35

In [14]:
windspeed_df = pd.DataFrame({                            # Data Frame 6
    "city" : ["delhi","mumbai"],
    "windspeed" : [7,12]
},index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [15]:
df = pd.concat([temperature_df,windspeed_df],axis=1)           # Concatanate = Data Frame 5 + Data Frame 6
df

        city  temperature    city  windspeed
0     mumbai           32  mumbai       12.0
1      delhi           40   delhi        7.0
2  bangalore           35     NaN        NaN

## 4. Series (Adding Series to DataFrame)

In [16]:
temperature_df                                              # Data Frame 7

        city  temperature
0     mumbai           32
1      delhi           40
2  bangalore           35

In [17]:
s = pd.Series(["humid","dry","rain"],name="event")           # Data Frame 8
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [18]:
df = pd.concat([temperature_df,s],axis=1)           # Concatanate = Data Frame 7 + Data Frame 8
df

        city  temperature  event
0     mumbai           32  humid
1      delhi           40    dry
2  bangalore           35   rain

----------

In [19]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [20]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [21]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [22]:
frames = [df1, df2, df3]

In [23]:
result = pd.concat(frames)
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

-------------